Catalogs/фин_ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_ФинансовыеПоказатели</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляПромежуточныхРасчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_ЕдиницыИзмеренияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуемыйНоменклатурныйПеречень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.узп_ИспользуемыеНоменклатурныеПеречни</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуемыйТипЦен</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_СправочникТиповЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанныхДляЦены</Name>
					<Comment>Источник данных для расчетов бюджетирования, ресурс которого будет использоваться для пересчета количественных оборотов по статье в суммовые</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ИсточникиДанныхДляРасчетовБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьЛимиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеУправленческоеПодразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_СправочникУправленческихПодразделений</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПроект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_СправочникПроектов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтносительныйПоказатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательИсточникаДанныхДляЦены</Name>
					<Comment>Показатель источника данных расчетов бюджетирования, который будет использоваться для пересчета количественного оборота по статье в суммовой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоРасценкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПеретекающегоОстатка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ПризнакиПеретекающихОстатковМеждуПериодами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЦенообразования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_СпособыЦенообразованияПоФинансовымПоказателям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляПлановыхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоКоличеству</Name>
					<Comment>Признак использования количественных оборотов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоПлановойНоменклатуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСумме</Name>
					<Comment>Признак использования суммовых оборотов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФормулыРасчетаФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаКоличество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФормулыРасчетаФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияКлассификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_КлассификаторСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтрокиБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория1Уровня</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория2Уровня</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подкласс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрезыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/фин_ВидыФинансовыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВидыФинансовыхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оборотный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОстаточный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассчитываемый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/узп_ИспользуемыеНоменклатурныеПеречни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>узп_ИспользуемыеНоменклатурныеПеречни</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РегламентированнаяНоменклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановаяНоменклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентированнаяИПлановаяНоменклатура</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_СпособыЦенообразованияПоФинансовымПоказателям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_СпособыЦенообразованияПоФинансовымПоказателям</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеРассчитывать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоБухгалтерскимЦенамНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПрогнознымЦенамНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЦенамПоставщиков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДаннымИсточникаРасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фиксированная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/фин_ФинансовыеПоказатели/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтоГруппа И НЕ ПометкаУдаления Тогда
		Если ВидПоказателя.Пустая() Тогда
			ВидПоказателя = Перечисления.фин_ВидыФинансовыхПоказателей.Оборотный;
		КонецЕсли;
		Обработанные = Новый Массив;
		Для Каждого СтрокаРазрез Из РазрезыУчета Цикл
			Если Обработанные.Найти(СтрокаРазрез.Измерение)=Неопределено Тогда
				Если РазрезыУчета.НайтиСтроки(Новый Структура("Измерение",СтрокаРазрез.Измерение)).Количество()>1 Тогда
					Обработанные.Добавить(СтрокаРазрез.Измерение);
					Отказ = Истина;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Финансовый показатель """+Наименование+""" не может быть записан: Разрез "+фин_РаботаСДополнительнымиРазрезамиБюджетирования.ПредставлениеРазреза(СтрокаРазрез.Измерение)+" назначен фин. показателю более одного раза!");
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаРазрез.Измерение) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Финансовый показатель """+Наименование+""" не может быть записан: в строке №"+Строка(СтрокаРазрез.НомерСтроки)+" разрезов находится пустое значение!");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если НЕ фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВестиУчетПоПлановойНоменклатуре") Тогда
			ИспользуемыйНоменклатурныйПеречень = Перечисления.узп_ИспользуемыеНоменклатурныеПеречни.РегламентированнаяНоменклатура;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	Если (НЕ (УчетПоКоличеству И УчетПоСумме)) ИЛИ (ВидПоказателя=Перечисления.фин_ВидыФинансовыхПоказателей.Рассчитываемый И ПоРасценкам) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СпособЦенообразования");
		МассивНепроверяемыхРеквизитов.Добавить("ИспользуемыйТипЦен");
		МассивНепроверяемыхРеквизитов.Добавить("ИсточникДанныхДляЦены");
		МассивНепроверяемыхРеквизитов.Добавить("ПоказательИсточникаДанныхДляЦены");
	КонецЕсли;
	Если СпособЦенообразования=Перечисления.фин_СпособыЦенообразованияПоФинансовымПоказателям.ПоДаннымИсточникаРасчетов
		ИЛИ СпособЦенообразования=Перечисления.фин_СпособыЦенообразованияПоФинансовымПоказателям.Фиксированная
		ИЛИ СпособЦенообразования=Перечисления.фин_СпособыЦенообразованияПоФинансовымПоказателям.НеРассчитывать Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИспользуемыйТипЦен");
	КонецЕсли;
	Если НЕ СпособЦенообразования=Перечисления.фин_СпособыЦенообразованияПоФинансовымПоказателям.ПоДаннымИсточникаРасчетов Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИсточникДанныхДляЦены");
		МассивНепроверяемыхРеквизитов.Добавить("ПоказательИсточникаДанныхДляЦены");
	КонецЕсли;
	Если НЕ ВидПоказателя=Перечисления.фин_ВидыФинансовыхПоказателей.Рассчитываемый Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Формула");
		МассивНепроверяемыхРеквизитов.Добавить("ФормулаКоличество");
	Иначе
		//Если НЕ УчетПоКоличеству Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ФормулаКоличество");
		//КонецЕсли;
		Если (НЕ УчетПоСумме) ИЛИ ПоРасценкам Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Формула");
		КонецЕсли;
	КонецЕсли;
	фин_ЗаполнениеДокументов.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
КонецПроцедуры

#КонецЕсли
